Tekla.Structures.DialogInternal.DialogDataStorage
The DialogDataStorage class handles storing data to the Tekla Structures
Object Dialog tree and retrieving it from there.

Tekla.Structures.DialogInternal.DialogDataStorage.GetVariable(Tekla.Structures.DialogInternal.AttributeInfo)
Gets the value of the named variable.
info: The AttributeInfo struct that contains the variable information.
Returns: The value of the requested variable.

Tekla.Structures.DialogInternal.DialogDataStorage.RegisterStringAttribute(System.String,System.String)
Registers a new string attribute for dialog for the named variable.
dialogName: The name of the dialog.
attributeName: The name of the attribute.

Tekla.Structures.DialogInternal.DialogDataStorage.SetVariable(Tekla.Structures.DialogInternal.AttributeInfo,System.String)
Sets a value for the named variable.
info: The AttributeInfo struct that contains the variable information.
dialogname: The name of the dialog for the variable information.

Tekla.Structures.DialogInternal.DialogDataStorage.SetVariableToStack(System.String,System.Object)
Sets a value for the named variable to stack.
name: The name of the variable.
data: The value of the variable.

Tekla.Structures.DialogInternal.DialogDataStorage.GetNextStringValue(System.String,System.Int32,System.String@)
Gets a dialog string value for the named variable.
attributeName: The name of the attribute.
index: The index for the attribute name.
value: The value of the attribute.

Tekla.Structures.DialogInternal.DialogDataStorage.SetStringVariable(System.String,System.String,System.String)
Sets a dialog string value for the named variable.
If string length is bigger than 80
registers and sets values for attributes with index in name
dialogName: The name of the dialog.
attributeName: The name of the attribute.
value: The value of the attribute.

Tekla.Structures.DialogInternal.DialogDataStorage.SetStringStackVariable(System.String,System.String)
Sets a dialog string value for the named variable.
If string length is bigger than 80
registers and sets values for attributes with index in name
attributeName: The name of the attribute.
value: The value of the attribute.